export const PREFECTURES = {
  0: "未設定",
  1: "北海道",
  2: "青森県",
  3: "岩手県",
  4: "宮城県",
  5: "秋田県",
  6: "山形県",
  7: "福島県",
  8: "茨城県",
  9: "栃木県",
  10: "群馬県",
  11: "埼玉県",
  12: "千葉県",
  13: "東京都",
  14: "神奈川県",
  15: "新潟県",
  16: "富山県",
  17: "石川県",
  18: "福井県",
  19: "山梨県",
  20: "長野県",
  21: "岐阜県",
  22: "静岡県",
  23: "愛知県",
  24: "三重県",
  25: "滋賀県",
  26: "京都府",
  27: "大阪府",
  28: "兵庫県",
  29: "奈良県",
  30: "和歌山県",
  31: "鳥取県",
  32: "島根県",
  33: "岡山県",
  34: "広島県",
  35: "山口県",
  36: "徳島県",
  37: "香川県",
  38: "愛媛県",
  39: "高知県",
  40: "福岡県",
  41: "佐賀県",
  42: "長崎県",
  43: "熊本県",
  44: "大分県",
  45: "宮崎県",
  46: "鹿児島県",
  47: "沖縄県",
};

export const JOB = {
  0: "未設定",
  1: "営業",
  2: "エンジニア",
  3: "企画・マーケ",
  4: "事務",
  5: "医療・福祉",
  6: "教育",
  7: "金融",
  8: "コンサル",
  9: "接客・サービス",
  10: "美容",
  11: "製造",
  12: "建築",
  13: "公務員",
  14: "自営業",
  15: "フリーランス",
  16: "学生",
  17: "その他",
};

export const EDUCATION = {
  0: "未設定",
  1: "高卒",
  2: "大卒",
  3: "大学院卒",
  4: "その他",
};

export const BODY_TYPE = {
  0: "未設定",
  1: "細め",
  2: "やや細め",
  3: "普通",
  4: "筋肉質",
  5: "やや太め",
  6: "太め",
};

export const INCOME = {
  0: "未設定",
  1: "〜500万円",
  2: "500〜700万円",
  3: "700〜1000万円",
  4: "1000万円以上",
};

export const HOLIDAY = {
  0: "未設定",
  1: "土日",
  2: "平日",
  3: "不定休",
};

export const ALCOHOL = {
  0: "未設定",
  1: "飲む",
  2: "たまに飲む",
  3: "飲まない",
};

export const SMOKING = {
  0: "未設定",
  1: "吸う",
  2: "吸わない",
  3: "非喫煙者の前では吸わない",
  4: "相手が嫌ならやめる",
};

export const LIVING = {
  0: "未設定",
  1: "一人暮らし",
  2: "実家",
  3: "その他",
};

export const MARRIAGE = {
  0: "未設定",
  1: "今すぐにしたい",
  2: "2~3年のうちに",
  3: "いい人がいれば",
  4: "わからない",
};

export const MEETING = {
  0: "未設定",
  1: "すぐ会いたい",
  2: "気が合えば会いたい",
  3: "気交流を深めてから",
};
